# your_app/management/commands/add_cities.py
from django.core.management.base import BaseCommand
from ...models import City


class Command(BaseCommand):
    help = 'Добавляет города России в модель City'

    def handle(self, *args, **kwargs):
        russian_cities = [
            "Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Казань",
            "Нижний Новгород", "Челябинск", "Самара", "Омск", "Ростов-на-Дону",
            "Уфа", "Красноярск", "Воронеж", "Пермь", "Волгоград",
            "Краснодар", "Саратов", "Тюмень", "Тольятти", "Ижевск",
            "Барнаул", "Ульяновск", "Иркутск", "Владивосток", "Ярославль",
            "Хабаровск", "Махачкала", "Оренбург", "Новокузнецк", "Кемерово",
            "Рязань", "Томск", "Астрахань", "Пенза", "Набережные Челны",
            "Липецк", "Тула", "Киров", "Чебоксары", "Калининград",
            "Брянск", "Курск", "Иваново", "Магнитогорск", "Тверь",
            "Ставрополь", "Белгород", "Сочи", "Нижний Тагил", "Архангельск",
            "Владимир", "Симферополь", "Смоленск", "Калуга", "Чита",
            "Орел", "Вологда", "Саранск", "Череповец", "Якутск",
            "Курган", "Кострома", "Комсомольск-на-Амуре", "Петрозаводск", "Новороссийск",
            "Йошкар-Ола", "Тамбов", "Назрань", "Стерлитамак", "Грозный"
        ]

        for city_name in russian_cities:
            City.objects.get_or_create(name=city_name)

        self.stdout.write(self.style.SUCCESS('Города успешно добавлены в модель City'))
